Name=["火霊魚","水霊魚","風霊魚","土霊魚","ライフグロウフィッシュ","フェイズフィッシュ","ナイトグリマー","フロストランサー","ドリフトマンタ","アースシェルフィッシュ","ペイルパファー","スカイバウンサー","ラブリーフィン","サンダーストライプフィッシュ","ヴォイドマンタ","タイタンツナ","紅命金魚","ココアフィッシュ","グレイシャースケイル","クリムゾンアバレーション","ボルトフィン","アビスクリスタルフィッシュ","アイギスシャーク","ドリームヴェノムフィッシュ","ネクロミレフィッシュ","ヴォイドリーパー","ブラッドカーニヴォアフィッシュ","エアリアルミストフィッシュ","プロミネンスフィッシュ","インパクトコアフィッシュ","デザートファントム","ルミナアクアジェム","サイレンスガーディアン"]
Discription=["火属性のマナを沢山受けて育った魚","水属性のマナを沢山受けて育った魚","風属性のマナを沢山受けて育った魚","土属性のマナを沢山受けて育った魚","淡く発光する体内には、絶えず再生し続ける生命の魔力が満ちている。","存在がわずかにこの世界からずれており、触れても実体を感じない。","暗闇の中でのみ鱗が妖しく輝く、夜海の捕食者。","冷たい水流を纏いながら突き進む魚。触れたものの動きを鈍らせる。","生気の薄い色合いをした平魚。その周囲では力が抜けていく感覚に襲われる。","土と鉱物が融合した外殻を持つ魚。その装甲は並の攻撃では傷一つ付かない。","生気の抜けた色合いのフグ。その毒は神経に直接作用し、急激に身体を蝕む。","空を跳ねるように移動する魚。その軌道は常識では測れない。","花のように鮮やかな体色を持つ魚。その鱗には生命の魔力が宿っている。","帯模様に沿って電流のような魔力が走る魚。その刺激は身体能力を引き上げる。","虚無の魔力を帯びた平魚。その周囲では力が抜け、動きが鈍くなる。","巨大な体躯と圧倒的な筋力を併せ持つ魚。その一撃は海流すら変える。","命の気を宿した紅の魚。その存在自体が癒やしをもたらす。","甘い香りを放つ不思議な魚。食べると身体にじんわりと活力が満ちてくる。","氷河のような鱗を持つ魚。その冷気は時間すら遅らせるかのようだ。","生物の枠を逸脱した存在。触れた者の身体を侵食し、破壊する。","鋭いヒレに電撃のような魔力を宿す魚。触れた者に強烈な刺激を与える","深海の静寂と結晶化した魔力を宿す魚。背の発光体は魔力の核とされる。","沈没船の鋼を喰らい、荒れ狂う波を鎧に変えて泳ぐ寡黙な“鉄壁の回遊者”。","夢と現実の狭間を泳ぎ、見る者に甘美な悪夢を植え付ける、夜色の鱗を持つ幻惑の毒魚。","一度死してなお腐敗した泥沼から這い出し、不浄な魔力で泳ぎ続ける亡霊の苔魚。","虚無の底で怨念を喰らい、ただ一点、赤く爛れた眼光で生者の魂を捉える深淵の処刑魚。","戦場に流れた血肉を啜り、剥き出しの赤き肉身を震わせて死地を泳ぐ血肉の飢餓魚。","風にほどけ、雲に紛れ、気まぐれに形を変えながら空を渡る、霧の命そのもの。","万物の母なる火を体内に宿し、夜を拒むかのように自ら燃え上がり天の海を泳ぐ日輪の化身。","臨界に達した熱核をその身に抱え、後方に炎を噴き上げながら一直線に全てを貫く指向性爆発の火種。","灼熱の砂と光に溶け込み、蜃気楼となって姿を欺く静かなる砂漠の幻影魚。","光を屈折させる結晶の身で海と同化し、純粋なる水の中でのみ王として君臨する宝石魚。","鋭い棘と紫の輝きであらゆる干渉を拒み、近づく者の精神を掻き乱す孤独なる拒絶の化身。"]
Condition=["","","","","満腹度20","透明化エフェクトを所持","光レベル0 かつ 夜","粉雪に埋もれてる","弱体化エフェクトを所持","耐性エフェクトを所持 または スニーク中","毒エフェクト所持","落下中 または 低速落下エフェクト所持","再生エフェクト かつ 緩衝体力を所持","雷雨 かつ スピードエフェクト所持","Y座標が10以下 または 暗闇エフェクト所持","攻撃力エフェクトを所持","再生と緩衝体力を所持","移動エフェクト所持","粉雪に埋もれている かつ 鈍足エフェクト所持","毒、衰弱、盲目、吐き気のいずれかを所持","発光エフェクトを所持 かつ 雷雨","水中 かつ 暗視と水中呼吸エフェクトを所持","鈍足エフェクトと耐性エフェクトを所持","夜間 かつ 毒と吐き気を所持","毒か衰弱と再生を所持","夜 かつ 盲目エフェクトを所持 かつ Y座標0~40","夜 かつ 空腹と攻撃力上昇を所持","低速落下と跳躍力上昇エフェクト かつ 落下中","火炎耐性を所持 かつ 燃焼中","移動速度と空腹エフェクトを所持 かつ 夜","昼 かつ 透明 かつ 晴れ かつ 発光","水中 かつ 幸運、暗視、水中呼吸を所持","盲目 かつ スニーク かつ 棘の鎧エンチャを装備時"]
IsLava=[5,17,18,27,29]

for i in range(1,34):
    if Condition[i-1]=="":
        ConditionText=""
    else:
        ConditionText='\\n§2条件：'+Condition[i-1]
    if i in IsLava:
        LiquidText="\\n§6溶岩釣り"
    else:
        LiquidText=""
    if i != 1:
        Parent='neoadvancement:neofishing/root/ceresta/'+str(i-1)
    else:
        Parent='neoadvancement:neofishing/root/ceresta'
    with open(str(i)+".json","w",encoding="utf-8") as f:
        f.write('{"parent": "'+Parent+'",\n  "display": {\n    "icon": {\n      "item": "minecraft:spider_eye",\n      "nbt": "{CustomModelData:'+str(i+1465)+'}"\n    },\n    "title": {\n      "translate": "魚類観測：'+Name[i-1]+'","color": "white","bold": true,"italic": false\n    },\n"description": {"translate": "§b条件：§r指定魚類(ID:'+str(i)+')を観測する。\\n§9説明：§r'+Discription[i-1]+ConditionText+LiquidText+'","color": "white"},\n    "frame": "task",\n    "show_toast": false,\n    "announce_to_chat": false,\n    "hidden": true\n  },\n  "criteria": {\n    "fishing_rod": {\n      "trigger": "inventory_changed",\n      "conditions": {\n        "items": [\n          {\n            "items": [\n              "fishing_rod"\n            ]\n          }\n        ]\n      }\n    },\n    "requirement": {\n      "trigger": "minecraft:inventory_changed",\n      "conditions": {\n        "player": {\n          "type_specific": {\n            "type": "player",\n            "advancements": {\n              "neoadvancement:neoitem/root": true\n            }\n          }\n        },\n        "items": [\n          {\n            "nbt": "{CustomModelData:'+str(i+1465)+'}","items": ["minecraft:spider_eye"]\n          }\n        ]\n      }\n    }\n  }\n}')
